In [38]:
import pandas as pd

rain = pd.read_csv("C:\\my_project\\data\\rainfall.csv")
rain.head()

   state  year  annual_rainfall
0    NaN  1901           3373.2
1    NaN  1902           3520.7
2    NaN  1903           2957.4
3    NaN  1904           3079.6
4    NaN  1905           2566.7

In [39]:
crop = pd.read_csv("C:\\my_project\\data\\crop.csv")
crop.head()

,State_Name,District_Name,Crop_Year,Season,Crop,Area,Production
0,Andaman and Nicobar Islands,NICOBARS,2000,Kharif,Arecanut,1254.0,2000.0
1,Andaman and Nicobar Islands,NICOBARS,2000,Kharif,Other Kharif pulses,2.0,1.0
2,Andaman and Nicobar Islands,NICOBARS,2000,Kharif,Rice,102.0,321.0
3,Andaman and Nicobar Islands,NICOBARS,2000,Whole Year,Banana,176.0,641.0
4,Andaman and Nicobar Islands,NICOBARS,2000,Whole Year,Cashewnut,720.0,165.0

In [40]:
# Clean crop dataset
crop_clean = crop.rename(columns={
    'State_Name': 'state',
    'District_Name': 'district',
    'Crop_Year': 'year',
    'Season': 'season',
    'Crop': 'crop',
    'Area': 'area',
    'Production': 'production'
})

crop_clean.head()

,state,district,year,season,crop,area,production
0,Andaman and Nicobar Islands,NICOBARS,2000,Kharif,Arecanut,1254.0,2000.0
1,Andaman and Nicobar Islands,NICOBARS,2000,Kharif,Other Kharif pulses,2.0,1.0
2,Andaman and Nicobar Islands,NICOBARS,2000,Kharif,Rice,102.0,321.0
3,Andaman and Nicobar Islands,NICOBARS,2000,Whole Year,Banana,176.0,641.0
4,Andaman and Nicobar Islands,NICOBARS,2000,Whole Year,Cashewnut,720.0,165.0

In [14]:
temp = pd.read_csv("C:\\my_project\\data\\temperatures.csv")
temp.head()

,YEAR,JAN,FEB,MAR,APR,MAY,JUN,JUL,AUG,SEP,OCT,NOV,DEC,ANNUAL,JAN-FEB,MAR-MAY,JUN-SEP,OCT-DEC
0,1901,22.40,24.14,29.07,31.91,33.41,33.18,31.21,30.39,30.47,29.97,27.31,24.49,28.96,23.27,31.46,31.27,27.25
1,1902,24.93,26.58,29.77,31.78,33.73,32.91,30.92,30.73,29.80,29.12,26.31,24.04,29.22,25.75,31.76,31.09,26.49
2,1903,23.44,25.03,27.83,31.39,32.91,33.00,31.34,29.98,29.85,29.04,26.08,23.65,28.47,24.24,30.71,30.92,26.26
3,1904,22.50,24.73,28.21,32.02,32.64,32.07,30.36,30.09,30.04,29.20,26.36,23.63,28.49,23.62,30.95,30.66,26.40
4,1905,22.00,22.83,26.68,30.01,33.32,33.25,31.44,30.68,30.12,30.67,27.52,23.82,28.30,22.25,30.00,31.33,26.57

In [15]:
# Clean temperature dataset
temp_clean = temp[['YEAR', 'ANNUAL']].rename(columns={
    'YEAR': 'year',
    'ANNUAL': 'annual_temperature'
})

temp_clean.head()

   year  annual_temperature
0  1901               28.96
1  1902               29.22
2  1903               28.47
3  1904               28.49
4  1905               28.30

In [16]:
rain.head()

   state  year  annual_rainfall
0    NaN  1901           3373.2
1    NaN  1902           3520.7
2    NaN  1903           2957.4
3    NaN  1904           3079.6
4    NaN  1905           2566.7

In [18]:
# Clean rainfall dataset (national-level)
rain_clean = rain[['year', 'annual_rainfall']]

rain_clean.head()

   year  annual_rainfall
0  1901           3373.2
1  1902           3520.7
2  1903           2957.4
3  1904           3079.6
4  1905           2566.7

In [19]:
# Merge crop + rainfall
merged = crop_clean.merge(rain_clean, on='year', how='left')

# Merge with temperature
merged = merged.merge(temp_clean, on='year', how='left')

merged.head()

,state,district,year,season,crop,area,production,annual_rainfall,annual_temperature
0,Andaman and Nicobar Islands,NICOBARS,2000,Kharif,Arecanut,1254.0,2000.0,2763.2,29.75
1,Andaman and Nicobar Islands,NICOBARS,2000,Kharif,Arecanut,1254.0,2000.0,2596.8,29.75
2,Andaman and Nicobar Islands,NICOBARS,2000,Kharif,Arecanut,1254.0,2000.0,2487.0,29.75
3,Andaman and Nicobar Islands,NICOBARS,2000,Kharif,Arecanut,1254.0,2000.0,2363.9,29.75
4,Andaman and Nicobar Islands,NICOBARS,2000,Kharif,Arecanut,1254.0,2000.0,2908.0,29.75

In [20]:
merged.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8859276 entries, 0 to 8859275
Data columns (total 9 columns):
 #   Column              Dtype
---  ------              -----
 0   state               object
 1   district            object
 2   year                int64
 3   season              object
 4   crop                object
 5   area                float64
 6   production          float64
 7   annual_rainfall     float64
 8   annual_temperature  float64
dtypes: float64(4), int64(1), object(4)
memory usage: 608.3+ MB

In [21]:
merged.describe()

,year,area,production,annual_rainfall,annual_temperature
count,8.859276e+06,8.859276e+06,8.724996e+06,8.818092e+06,8.859276e+06
mean,2.005643e+03,1.200282e+04,5.825034e+05,1.359303e+03,2.984456e+01
std,4.952154e+00,5.052330e+04,1.706578e+07,8.575885e+02,2.496563e-01
min,1.997000e+03,4.000000e-02,0.000000e+00,9.240000e+01,2.905000e+01
25%,2.002000e+03,8.000000e+01,8.800000e+01,7.484000e+02,2.975000e+01
50%,2.006000e+03,5.820000e+02,7.290000e+02,1.093000e+03,2.981000e+01
75%,2.010000e+03,4.392000e+03,7.023000e+03,1.660500e+03,2.999000e+01
max,2.015000e+03,8.580100e+06,1.250800e+09,4.229400e+03,3.030000e+01

In [22]:
merged.isnull().sum()

state                      0
district                   0
year                       0
season                     0
crop                       0
area                       0
production            134280
annual_rainfall        41184
annual_temperature         0
dtype: int64

In [23]:
# Fill missing production with 0
merged['production'] = merged['production'].fillna(0)

# Fill missing rainfall with average rainfallssssssssss
avg_rainfall = merged['annual_rainfall'].mean()
merged['annual_rainfall'] = merged['annual_rainfall'].fillna(avg_rainfall)

# Check again
merged.isnull().sum()

state                 0
district              0
year                  0
season                0
crop                  0
area                  0
production            0
annual_rainfall       0
annual_temperature    0
dtype: int64

In [24]:
merged[['production', 'annual_rainfall']].corr()

                 production  annual_rainfall
production         1.000000         0.000058
annual_rainfall    0.000058         1.000000

In [26]:
merged[['production', 'annual_temperature']].corr()

                    production  annual_temperature
production            1.000000            0.001765
annual_temperature    0.001765            1.000000

In [30]:
yearly = merged.groupby('year').agg({
    'production': 'sum',
    'annual_rainfall': 'mean',
    'annual_temperature': 'mean'
}).reset_index()

yearly.head()

   year    production  annual_rainfall  annual_temperature
0  1997  3.064438e+10      1416.175000               29.05
1  1998  2.097115e+11      1526.777778               29.70
2  1999  2.316480e+11      1388.022222               29.81
3  2000  2.681895e+11      1325.163971               29.75
4  2001  2.687595e+11      1302.702778               29.99

In [33]:
top_states = merged.groupby('state')['production'].sum().sort_values(ascending=False).head(5)
top_states

state
Kerala            3.523682e+12
Andhra Pradesh    6.236853e+11
Tamil Nadu        4.347519e+11
Uttar Pradesh     1.164417e+11
Assam             7.602306e+10
Name: production, dtype: float64

In [32]:
top_crops = merged.groupby('crop')['production'].sum().sort_values(ascending=False).head(5)
top_crops

crop
Coconut      4.679339e+12
Sugarcane    1.992845e+11
Rice         5.779693e+10
Wheat        4.798172e+10
Potato       1.529375e+10
Name: production, dtype: float64